export const manualFullText = `مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وسَلَّمَ
والِدُهُ عَبْدُ اللّٰهِ، وجَدُّهُ عَبْدُ المُطَّلِبِ، وأُمُّهُ آمِنةُ بِنْتُ وَهْبٍ. تُوُفِّيَ أَبُوهُ وأُمُّهُ حامِلٌ بِهِ، ودُفِنَ في المَدِينةِ.
وُلِدَ رَسُولُ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الإثْنَيْنِ في الثّانِي عَشَرَ مِنْ شَهْرِ رَبيعٍ الأَوَّلِ عامَ الفيلِ (٥٧٠ م). وفَرِحَ عَبدُ المُطَّلِبِ بِمِيلادِ حَفِيدِهِ، فَأَخَذَهُ، وحَمَلَهُ، وأَدخَلَهُ الكَعبةَ، وسَمّاهُ مُحَمَّدًا.
وَهُوَ مُحَمَّدٌ بْنُ عَبْدِ اللّٰهِ بْنِ عَبْدِ المُطَّلِبِ بْنِ هَاشِمِ، ويَنْتَهِي نَسَبُهُ إلى إِسْماعيلَ بْنِ إِبْراهيمَ.
مُرضِعَتُهُ
كانَتْ حَلِيمةُ تَعْمَلُ مُرْضِعةً، فَجاءَتْ إلى مَكّةَ مَعَ مَجْمُوعةٍ مِنْ المُرْضِعاتِ. أَخَذَتْ حَلِيمةُ المَولُودَ اليَتِيمَ (مُحَمَّدًا صَلَّى اللّٰهُ عَلَيهِ وسَلَّمَ) لِتُرضِعَهُ، ثُمَّ رَجَعَتْ إلى دِيارِها.
في الطَّرِيقِ لاحَظَتْ حَلِيمةُ البَرَكةَ في كُلِّ شَيءٍ، كانَ حَليبُ ناقَتِها قَليلًا فَأَصْبَحَ كَثيرًا، وَكانَ مَركوبُها ضَعيفًا فَأَصْبَحَ قَوِيًّا. وأَمّا في دِيارِها (بادِيَةِ بَني سَعدٍ) فَكانَ المَطَرُ يَنزِلُ قَلِيلًا فَأَصْبَحَ يَنزِلُ كَثيرًا، وكانَتْ أَغْنامُها تَرْجِعُ مِنَ المَرْعى شَبْعانةً.
في تِلْكَ البادِيةِ رَعى رَسولُ الله صَلَّى الله عَلَيْهِ وَسَلَّمَ الغَنَمَ، وَنَشَأَ على البَساطةِ والفَصاحَةِ، وبَعْدَ سَنَتَيْنِ أَرْجَعَتْهُ حَليمَةُ إلى أُمِّهِ.
وَفاةُ أُمِّهِ
كانَتْ أُمُّهُ (آمِنةُ) تَعِيشُ في مَكّةَ، وكانَ أَخْوالُهُ يَعِيشُونَ في يَثْرِبَ. أَرادَتْ آمِنةُ أنْ تَزُورَ إخوَتَها، فَذَهَبَتْ إلَيهِمْ، وأَخَذَتْ مَعَها ابْنَها مُحَمَّدًا. اِنتَهَتْ الزِّيارةُ، وأَرادَتْ أَنْ تَرْجِعَ إلى مَكّةَ. خَرَجَتْ مِنْ يَثْرِبَ بِاتِّجاهِ مَكّةَ، وفِي الطَّرِيقِ تُوُفِّيَتْ، وكانَ عُمرُ مُحَمَّدٍ سِتَّ سَنَواتٍ.
وَفاةُ جَدِّهِ
أَصْبَحَ عُمْرُ مُحَمَّدٍ ثَمانِيَ سَنَواتٍ، فَتُوُفِّيَ جَدُّهُ. كَفِلَهُ عَمُّهُ أَبُو طالِبٍ، وأَخَذَهُ مَعَهُ إلى بَيْتِهِ لِيَعِيشَ هُناكَ مَعَ العائِلةِ.
أَخْلاقُهُ
نَشَأَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ في الجاهِليّةِ، ولكِنَّهُ لَمْ يَسْجُدْ لِصَنَمٍ قَطُّ، ولَمْ يَأْكُلْ مِنْ ذَبائِحِ الجاهِليّةِ.
حِلفُ الفُضُولِ
جاءَ تاجِرٌ إلى سوقِ مَكّةَ، ومَعَهُ بِضاعَةٌ يُرِيدُ أَنْ يَبِيعَها. أَثْناءَ ذَلِكَ جاءَ زَبُونٌ، واشْتَرى بِضاعةً مِنَ التّاجِرِ ولَكِنَّهُ لَمْ يَدفَعْ ثَمَنَها. غَضِبَ التّاجِرُ، واشتَكى إلى النّاسِ، فَلَم يَنصُرْهُ أَحَدٌ.
في المُقابِلِ رَأَى بَعضُ عُقَلاءِ مَكّةَ ذلِكَ، فَغَضِبُوا، ودَعَوا النّاسَ إلى اجتِماعٍ عاجِلٍ. اِجتَمَعَ النّاسُ، وتَحَدَّثُوا في مَوْضُوعِ حُقُوقِ التُّجّارِ والتِّجارةِ.
في النِّهايةِ اتَّفَقُوا عَلى نُصْرةِ المَظلُومِ ومُساعَدةِ المُحْتاجِ. وسُمِّيَ هذا الاِتِّفاقُ بِحِلفِ الفُضُولِ.
واشتَرَكَ مُحَمَّد صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ في هَذا الحِلْفِ، وكانَ عُمْرُهُ أَقَلَّ مِنْ عِشْرِينَ عامًا. وكانَ الرَّسُولُ صَلَّى اللّٰهُ عَلَيهِ وسَلَّمَ يُحِبُّ هذا الحِلفَ.
زَواجُ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ
أَثْناءَ إقامَتِهِ في بَيْتِ عَمِّهِ عَمِلَ في التِّجارةِ، وتاجَرَ في مالِ خَدِيجةَ بِنْتِ خُوَيْلِدٍ بِصِدْقٍ وإخْلاصٍ وأَمانةٍ. بَعْدَ مُدّةٍ أَحَبَّتْ خَدِيجةُ مُحَمَّدًا صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ بِسَبَبِ صِدْقِهِ وإخْلاصِهِ وأَمانَتِهِ، وطَلَبَتْ مِنهُ الزَّواجَ وَكانَ عُمْرُها أَرْبَعينَ سَنَةً.
شاوَرَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ أَعْمامَهُ، وَذَهَبَ مَعَ عَمِّهِ حَمْزَة، فَخَطَبَهَا مِنْ أبِيها، فَتَزَوَّجَهَا، وكانَ عُمْرُ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ خمْسًا وَعِشْرينَ سَنةً.
أَوْلَادُهُ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ مِنْ خَدِيجَةَ
وَلَدَتْ السَّيِّدةُ خَدِيجةُ لِرَسُولِ اللَّهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ وَلَدَهُ كُلَّهُمْ إلَّا إبْرَاهِيمَ. وَلَدَتْ السَّيِّدةُ خَدِيجةُ القَاسِمَ، ووَلَدَتْ الطَّاهِرَ، وَالطَّيِّبَ، وَزَيْنَبَ، وَرُقَيَّةَ، وَأُمَّ كُلْثُومٍ، وَفَاطِمَةَ.
أَكْبَرُ أبناءِ النَّبِيِّ الْقَاسِمُ، ثُمَّ الطَّيِّبُ، ثُمَّ الطَّاهِرُ، وَأَكْبَرُ بَنَاتِهِ رُقَيَّةُ، ثُمَّ زَيْنَبُ، ثُمَّ أُمُّ كُلْثُومٍ، ثُمَّ فَاطِمَةُ.
الحَجَرُ الأَسْوَدُ
جاءَ سَيْلٌ قَوِيٌّ بِاتِّجاهِ الكَعْبةِ، فَهَدَمَها. أَرادَ أَهْلُ مَكّةَ أَنْ يُعِيدُوا بِناءَها، فَأَحْضَرُوا أَدَواتِ البِناءِ، وجاؤُوا إلى الكَعْبةِ، وبَدَؤُوا البِناءَ.
أَثْناءَ البِناءِ اِخْتَلَفَ النّاسُ في تَعْمِيرِ الحَجَرِ الأَسْوَدِ، فَكُلُّ قَبِيلةٍ تُرِيْدُ أَنْ تَحْمِلَهُ وتَضَعَهُ مَكانَهُ. أَثْناءَ ذَلِكَ دَخَلَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ الحَرَمَ، فَرَآهُ النّاسُ، فَطَلَبُوا مِنْهُ أَنْ يَحْكُمَ بَيْنَهُمْ.
قَبِلَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ، وحَلَّ الخِلافَ بَينَهُمْ، فَطَلَبَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ مِنْ القَبائِلِ أنْ يُحْضِرُوا بِساطًا، ويَمُدُّوهُ، ويَضَعُوا الحَجَرَ الأَسوَدَ فَوقَهُ، ثُمَّ يَرْفَعُوهُ إلى مَكانِهِ. رَضِيَتْ القَبائِلُ بِهَذا الحَلِّ، ووَضَعَتْ الحَجَرَ الأَسوَدَ مَكانَهُ، وانْتَهى الخِلافُ، وحُلَّتْ المُشْكِلةُ.
في غارِ حِراءَ
كانَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ يَذْهَبُ إلى غارِ حِراءَ، ويَبقى شَهْرَ رَمَضانَ هُناكَ، يَتَعَبَّدُ ويَتَفَكَّرُ في خَلْقِ اللّٰهِ. أَثْناءَ ذلِكَ نَزَلَ جِبرِيلُ عَلَيهِ، وضَمَّهُ بِقُوّةٍ، وقالَ لَهُ: اِقْرَأْ. قالَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ: ما أَنا بِقارِئٍ. كَرَّرَ عَلَيهِ جِبرِيلُ، وقالَ لَهُ: اِقْرَأْ. قالَ النَّبِيُّ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ: ما أَنا بِقارِئٍ. كَرَّرَ جِبرِيلُ عَلى مُحَمَّدٍ لِلْمَرّةِ الثّالِثةِ، وقالَ: ﴿اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الْأَكْرَمُ * الَّذِي عَلَّمَ بِالْقَلَمِ * عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ ﴾ [العلق: ١-٥]
رَجَعَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ إلى خَدِيجةَ خائِفًا، وهُوَ يَقُولُ: زَمِّلوني زَمِّلوني (غَطّونِي). غَطَّتْهُ السَّيِّدةُ خَديجةُ، وَهَدَّأَتْ مِنْ خَوْفِهِ، ثُمَّ سَأَلَتْهُ: ما بِكَ يا مُحَمَّدٌ؟ ماذا حَدَثَ مَعَكَ؟ لِماذا أَنْتَ خائِفٌ؟
أَخْبَر مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ خَدِيجةَ عَن الَّذِي حَدَثَ لَهُ، ثُمَّ قالَ: يا خَديجةُ، خِفْتُ عَلى نَفْسِي. قالَتْ خَديجةُ: كَلّا واللّٰهِ، لا يُخْزِيكَ اللّٰهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ، وتُساعِدُ الضَّعِيفَ، وتُكْرِمُ الضَّيْفَ.
اِنقِطاعُ الوَحْيِ
ذَهَبَ النّبِيُّ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ إلى غارِ حِراءَ لِيَلْتَقِيَ بِجِبْرِيلَ، ولَكِنَّهُ لَمْ يَجِدْهُ، ثُمَّ ذَهَبَ في اليَوْمِ التّالِي، فَلَمْ يَجِدْهُ. حَزِنَ مُحَمَّدٌ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ بِسَبَبِ اِنْقِطاعِ الوَحْيِ.
بَعْدَ أَربَعِينَ يَومًا نَزَلَ جِبْريلُ على الرَّسُولِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ، وَهُوَ يَقْرَأُ عَلَيْهِ: ﴿يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ * وَثِيَابَكَ فَطَهِّرْ * وَالرُّجْزَ فَاهْجُرْ﴾ [المدثر: ١-٥]
الدَّعْوةُ السِّرِّيّةُ
دَعا الرَّسُولُ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ أَقْرِباءَهُ إلى الإسْلامِ، ودَعا أَصْدِقاءَهُ أَيْضًا. خِلالَ الدَّعْوةِ السِّرِّيّةِ أَسلَمَتْ خَدِيجةُ، وأَسْلَمَ أَبُو بَكْرٍ وعَلِيٌّ وأَسْلَمَ زَيدُ بنُ حارِثةَ كَذَلِكَ. اِستَمَرَّت الدَّعْوةُ السِّرِّيّةُ ثَلاثَ سَنواتٍ، وبَلَغَ عَدَدُ المُسْلِمينَ فَوْقَ الثَّلاثينَ، وكانَ الرَّسُولُ يَلتَقِي بِالمُسلِمِينَ في دارِ الأَرْقَمِ.
الجَهْرُ بِالدَّعْوةِ
أَمَرَ اللّٰهُ رَسُولَهُ بِالجَهرِ بِالدَّعوةِ، فَقامَ الرَّسُولُ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ، ودَعا النّاسَ إلى عِبادةِ اللّٰهِ، ودَعاهُم إلى تَرْكِ الأَصْنامِ. غَضِبَ المُشْرِكونَ مِنَ النَّبِيِّ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ، وذَهَبُوا إلى عَمِّهِ (أبُو طالِب)، وقالُوا لَهُ: يا أَبا طالِبٍ، إِنَّ ابْنَ أَخِيكَ سَبَّ آلِهَتَنا، وعابَ دِينَنا. إِمّا أَنْ تَمْنَعَهُ أَنْتَ، وإِمّا أَنْ نَمْنَعَهُ نَحْنُ.
ذَهَبَ أَبُو طالِبٍ إلى رَسولِ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ، وأَخْبَرَهُ. قالَ النَّبِيُّ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ: يَا عَمِّي، لَوْ وُضِعَتِ الشَّمْسُ في يَمِينِــــــــي وَالْقَمَرُ في يَسَارِي مَا تَرَكْتُ هَذِهِ الدَّعْوةَ.
إيذاءُ المُشْرِكِينَ
جاءَ المُشْرِكونَ، وضَرَبُوا رَسولَ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ بِشِدّةٍ. قامَ أَبو بَكْرٍ، وقال: لِماذا تَفعَلُونَ ذلِكَ يا كُفّارُ؟! جاءَ المُشْرِكونَ إلى أَبِي بَكْرٍ، وضَرَبوهُ بِشِدّةٍ كَذَلِكَ.
وكانَ المُشْرِكونَ يُخْرِجُونَ ياسِرًا وزَوْجَتَهُ وولَدَهُ عَمّارًا إلى الصَّحْراءِ الحارّةِ، ويُعَذِّبونَهُمْ لِيَكْفُرُوا، ولَكِنَّهُمْ كانُوا ثابِتِينَ عَلى الحَقِّ.
امْرَأةِ أَبِي لَهَبٍ
كانَ أَبُو لَهَبٍ يُؤْذِي رَسُولَ اللّٰهِ، وكانَتْ اِمْرَأَةُ أَبِي لَهَبٍ تُؤْذِي رَسُولَ اللّٰهِ كَذِلِكَ، كانَتْ تِلْكَ المَرْأةُ تَضَعُ الشَّوْكَ في طَريقِ النَّبِيِّ أَحْيانًا، وأَحْيانًا أُخْرى تَضَعُهُ عَلى بابِ بَيْتِهِ. أَثْناءَ ذَلِكَ نَزَلَتْ سورةُ المَسَدِ(1). سَمِعَتْ اِمْرَأَةُ أَبِي لَهَبٍ بِهَذِهِ السّورةِ، فَغَضِبَتْ غَضَبًا شَدِيدًا، وبَحَثَتْ عَن رَسُولِ اللّٰهِ لِتُؤْذِيَهُ.
جاءَتْ تِلْكَ المَرْأةُ إلى الكَعبةِ، فَرَأَتْ أَبا بَكْرٍ - وكانَ الرّسُولُ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ جالِسًا مَعَهُ - فَقالَتْ: يا أَبا بَكْرٍ، أَيْنَ صاحِبُكَ؟ سَمِعْتُ أنَّهُ يَهْجُونِي. فَواللّٰهِ، سَأَضْرِبُهُ بِهَذا الحَجَرِ، ثُمَّ ذَهَبَتْ.
قالَ أَبو بَكْرٍ لِرَسُولِ اللّٰهِ: يا رَسُولَ اللّٰهِ، لِماذا تَسْأَلُنِي عَنْكَ، وأَنْتَ مَعِي!؟ قالَ رَسُولُ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ: ما رَأَتْنِي، لَقَدْ أَخَذَ اللّٰهُ بِبَصَرِها عَنِّي.
حِوارُ المُشْرِكينَ
جاءَ عُتْبةُ (رَجُلٌ مِنَ المُشْرِكِينَ) إلى رَسولِ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ، فَقالَ: يا مُحَمَّدُ، هَلْ أَنْتَ أَفْضَلُ أَمْ أَبُوكَ؟ يا مُحَمَّدُ، هَلْ أَنْتَ أَفْضَلُ أَمْ عَبْدُ المُطَّلِبِ؟ ثُمَّ قالَ: يا مُحَمَّدُ، آباؤُكَ وأَجْدادُكَ عَبَدُوا الآلِهةَ، فَلِماذا أَنْتَ لا تَعبُدُ الآلِهةَ؟ ولِماذا تَدعُوا النّاسَ إلى دِينٍ جَدِيدٍ؟ يا مُحَّمَّدُ، هَلْ تُرِيدُ مالًا؟ نُعطِيكَ. هُلْ تُرِيدُ مُلكًا؟ نُعطِيكَ. هَل أَنتَ مَرِيضٌ؟ نُداوِيكَ.
بَعدَ أَنْ اِنتَهى عُتبةُ مِنْ كَلامِهِ قَرَأَ رَسولُ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ عليه آياتٍ مِنَ القُرآنِ الكَريمِ. اِستَمَعَ عُتبةُ إلى الآياتِ، ثُمَّ رَجَعَ إلى أَصْحابِهِ المُشْرِكِينَ، فَقالوا لَهُ:
فَقَالُوا لَهُ: مَاذا حَدَثَ مَعَكَ يَا عُتْبةُ؟
عُتْبةُ: واللّٰه، سَمِعْتُ قَوْلًا جَمِيلًا جِدًّا، مَا سَمِعْتُ مِثْلَهُ قَطُّ. يَا مَعْشَرَ قُرَيْشٍ، أَطِيعُونِي، واتْرُكُوا هَذَا الرَّجُلَ.
المُشْرِكُونَ: وَاَللَّهِ، سَحَرَكَ مُحَمَّدٌ.
الهِجْرةُ إلى الحَبَشةِ
طَلَبَ رَسُولُ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ مِنَ المُسْلِمِينَ أَنْ يُهاجِرُوا إلى الحَبَشةِ، فَهاجَرُوا. عَرَفَ المُشْرِكونَ بِذَلِكَ، فأَرْسَلُوا وَفْدًا إلى النَّجاشِيِّ (مَلِكِ الحَبَشةِ)، لِيُخْرِجَ المُسْلِمِينَ مِنْ أَرضِهِ، فَرَفَضَ النَّجاشِيُّ طَلَبَهُمْ.`;
